SMMB-DEV/STM32-Tools/GSM/GSM.hpp
#pragma once

#include "main.h"

#ifdef HAL_UART_MODULE_ENABLED

#include "../Core/Utils.hpp"
#include "../Core/strv.hpp"
#include "../Core/span.hpp"
#include "../Log.hpp"

#include <memory>	// unique_ptr
#include <optional>
#include <variant>


#ifdef STM32T_IWDG_TIMEOUT
extern "C" IWDG_HandleTypeDef hiwdg;
#endif	// STM32T_IWDG_TIMEOUT

#if defined(STM32T_GSM_URC_SUPPORT) && USE_HAL_UART_REGISTER_CALLBACKS == 1

#define STM32T_GSM_URC_ENABLED

#ifndef STM32T_GSM_URC_BUF_SIZE
#define STM32T_GSM_URC_BUF_SIZE		512
#endif	// STM32T_GSM_URC_BUF_SIZE

#endif	// defined(STM32T_GSM_URC_SUPPORT) && USE_HAL_UART_REGISTER_CALLBACKS == 1



#define CM_CODE(name, code)		name = -(code)

#define CM_CODE_10(name, code)		CM_CODE(name##0, (code) * 10 + 0), CM_CODE(name##1, (code) * 10 + 1), \
CM_CODE(name##2, (code) * 10 + 2), CM_CODE(name##3, (code) * 10 + 3), CM_CODE(name##4, (code) * 10 + 4), CM_CODE(name##5, (code) * 10 + 5), \
CM_CODE(name##6, (code) * 10 + 6), CM_CODE(name##7, (code) * 10 + 7), CM_CODE(name##8, (code) * 10 + 8), CM_CODE(name##9, (code) * 10 + 9)

#define CM_CODE_100(name, code)		CM_CODE_10(name##0, (code) * 10 + 0), CM_CODE_10(name##1, (code) * 10 + 1), \
CM_CODE_10(name##2, (code) * 10 + 2), CM_CODE_10(name##3, (code) * 10 + 3), CM_CODE_10(name##4, (code) * 10 + 4), CM_CODE_10(name##5, (code) * 10 + 5), \
CM_CODE_10(name##6, (code) * 10 + 6), CM_CODE_10(name##7, (code) * 10 + 7), CM_CODE_10(name##8, (code) * 10 + 8), CM_CODE_10(name##9, (code) * 10 + 9)



#define _FORMAT_ARGS()	\
	if (!fmt) \
		return FAIL; \
	\
	char args[ARG_LEN]; \
	\
	va_list print_args; \
	va_start(print_args, fmt); \
	const ErrorCode argsLen = (ErrorCode)FormatArgs(args, sizeof(args), fmt, print_args); \
	\
	if (argsLen < OK) \
		return argsLen
	

#define _GET_ARGS(var_name) \
strv args; \
char _args_buf[ARG_LEN]; \
\
if (const strv *p = std::get_if<const strv>(&var_name)) \
	args = *p; \
else \
{ \
	const char *const *fmt = std::get_if<const char *>(&var_name); \
	if (!fmt) \
		return FAIL; \
	\
	va_list print_args; \
	va_start(print_args, var_name); \
	const ErrorCode argsLen = (ErrorCode)FormatArgs(_args_buf, sizeof(_args_buf), *fmt, print_args); \
	\
	if (argsLen < OK) \
		return argsLen; \
	\
	args = {_args_buf, size_t(argsLen)}; \
}



namespace STM32T
{
	template <uint32_t DEF_RX_TO = 300, uint32_t DEF_IDLE_TO = 20, uint32_t DEF_O2C_TO = 1000>
	class GSM
	{
		using This = GSM<DEF_RX_TO, DEF_IDLE_TO, DEF_O2C_TO>;
		
	public:
		static constexpr size_t IMEI_LEN = 15, IMSI_LEN = 15, DEFAULT_RESPONSE_LEN = 64, DEFAULT_ARG_LEN = 64, RESPONSE_EXTRA = 12;		// \r\n+CME: xxx\r\n
		static constexpr uint32_t
			DEFAUL_TRANSMIT_TIMEOUT			= 10'000,
			DEFAUL_RECEIVE_TIMEOUT			= DEF_RX_TO,
			DEFAULT_IDLE_TIMEOUT			= DEF_IDLE_TO,
			DEFAULT_ONLINE_TO_CMD_TIMEOUT	= DEF_O2C_TO;
		
		enum ErrorCode : int32_t
		{
			OK				= +0,
			NOT_ALLOWED		= -1,
			INVALID			= -2,
			INVALID_PARAM	= INVALID,	// todo: remove?
			BIG_PARAM		= -3,
			TIMEOUT			= -4,
			WRONG_FORMAT	= -5,	// In response
			ERR				= -6,	// Failure on the module side
			FAIL			= -7,	// Failure on the MCU side or in library
			BUF_FULL		= -8,	// User's buffer
			UNKNOWN			= -9,
			
			// GL865
			CM_CODE_100(CME_0, 10), CM_CODE_100(CME_1, 11),
			CM_CODE_100(CME_5, 15), CM_CODE_100(CME_6, 16), CM_CODE_100(CME_7, 17), CM_CODE_100(CME_8, 18), CM_CODE_100(CME_9, 19),
			
			CM_CODE_100(CMS_0, 20), CM_CODE_100(CMS_1, 21), CM_CODE_100(CMS_2, 22), CM_CODE_100(CMS_3, 23),
			CM_CODE(CMS_500, 2500), CM_CODE(CMS_512, 2512),
		};
		
	protected:
		static constexpr STM32T::Log::Logger LG = STM32T::Log::g_defaultLogger.Clone(STM32T::Log::Level::Debug, "GSM"sv);
		
		static constexpr strv ESC = "\x1B"sv, CTRL_Z = "\x1A"sv, CMD_MODE = "+++"sv;
		
		enum class CommandType : uint8_t
		{
			Test,		// AT+CMD=?\r
			Read,		// AT#CMD?\r
			Execute,	// AT@CMDARGS\r
			Write,		// AT+CMD=ARGS\r
			Bare		// ARGS
		};
		
		uint32_t m_lastSend = 0;
		UART_HandleTypeDef* const p_huart;
		bool m_urcEnabled = false;
		
		void addURCs(const vec<strv>& tokens, size_t len = SIZE_MAX)
		{
			for (size_t i = 0; i < tokens.size() && i < len; ++i)
				addURC(tokens[i]);
		}
		
		void addURCFromBuf(const strv buf)
		{
			vec<strv> tokens;
			buf.tokenize("\r\n"sv, tokens, true);
			addURCs(tokens);
		}
		
		void SendUART(strv data)
		{
			HAL_UART_Transmit(p_huart, reinterpret_cast<const uint8_t *>(data.data()), data.length(), DEFAUL_TRANSMIT_TIMEOUT);
		}
		
		void SendUART(const char ch)
		{
			HAL_UART_Transmit(p_huart, reinterpret_cast<const uint8_t *>(&ch), 1, DEFAUL_TRANSMIT_TIMEOUT);
		}
		
		void SendUCS2(strv data)
		{
			for (auto ch : data)
			{
				SendUART(STM32T::H2C(ch >> 4));
				SendUART(STM32T::H2C(ch));
			}
		}
		
		void SendUCS2(u16strv data)
		{
			for (auto ch : data)
			{
				SendUART(STM32T::H2C(ch >> 12));
				SendUART(STM32T::H2C(ch >> 8));
				SendUART(STM32T::H2C(ch >> 4));
				SendUART(STM32T::H2C(ch));
			}
		}
		
		int32_t ReceiveUART(char *buffer, uint16_t len, const uint32_t timeout, const uint32_t idle_timeout)
		{
			const auto start = HAL_GetTick();
			
			__HAL_UART_CLEAR_OREFLAG(p_huart);
			HAL_StatusTypeDef stat = HAL_TIMEOUT;
			
			#ifdef STM32T_IWDG_TIMEOUT
			while (1)
			{
				HAL_IWDG_Refresh(&hiwdg);
				
				if (stat == HAL_OK)
					goto ok;
				else if (stat != HAL_TIMEOUT)
					break;
				
				const uint32_t t = std::min(STM32T::Time::Remaining_Tick(start, timeout), (STM32T_IWDG_TIMEOUT));
				if (!t)
					break;
				
				stat = HAL_UART_Receive(p_huart, (uint8_t *)buffer, 1, t);
			}
			#else
			stat = HAL_UART_Receive(p_huart, (uint8_t *)buffer, 1, timeout);
			if (stat == HAL_OK)
				goto ok;
			#endif	// STM32T_IWDG_TIMEOUT
			
			return stat == HAL_TIMEOUT ? TIMEOUT : FAIL;
			
		ok:
			const uint16_t orig_len = len;
			
			for (uint16_t i = 1; i < len; i++)
			{
				if (HAL_GetTick() - start > timeout)
					return i;
				
				stat = HAL_UART_Receive(p_huart, (uint8_t *)&buffer[i], 1, idle_timeout);
				if (stat != HAL_OK)
					return i;
			}
			
