SMMB-DEV/STM32-Tools/GSM/GSM.hpp
			return orig_len;
		}
		
		int32_t Command(const uint32_t timeout, const CommandType type, const strv cmd, const strv args, char* buffer, const uint16_t len)
		{
			if (type != CommandType::Bare)
			{
				SendUART("AT"sv);
				SendUART(cmd);
			}
			
			if ((type == CommandType::Write && !args.empty()) || type == CommandType::Test)
				SendUART("="sv);
			
			if (type == CommandType::Write || type == CommandType::Execute || type == CommandType::Bare)
				SendUART(args);
			else
				SendUART("?"sv);
			
			if (type != CommandType::Bare)
				SendUART("\r"sv);
			
			if (buffer && len)
			{
				if (m_urcEnabled)
					stopURC();
				
				const int32_t len2 = ReceiveUART(buffer, len - 1, timeout, DEFAULT_IDLE_TIMEOUT);
				
				if (m_urcEnabled)
					startURC();
				
				if (len2 < OK)
					return ErrorCode(len2);
				
				buffer[len2] = 0;		// Make it safe for C str functions
				
				return len2;
			}
			
			return 0;
		}
		
		ErrorCode Standard(vec<strv>& tokens)
		{
			ErrorCode ret = UNKNOWN;
			for (size_t i = 0; i < tokens.size(); i++)
			{
				if (tokens[i] == "OK"sv)
				{
					ret = OK;
					tokens.erase(tokens.begin() + i);
					break;
				}
			}
			
			if (ret == UNKNOWN)
				ret = Error(tokens);
			else
				addURCs(tokens);
			
			return ret;
		}
		
		ErrorCode Error(vec<strv>& tokens)
		{
			ErrorCode ret = UNKNOWN;
			for (size_t i = 0; i < tokens.size(); i++)
			{
				uint16_t code;
				if (1 == std::sscanf(tokens[i].data(), "+CME ERROR: %3hu", &code))
				{
					tokens.erase(tokens.begin() + i);
					ret = ErrorCode(-1000 - code);
					break;
				}
				
				if (1 == std::sscanf(tokens[i].data(), "+CMS ERROR: %3hu", &code))
				{
					tokens.erase(tokens.begin() + i);
					ret = ErrorCode(-2000 - code);
					break;
				}
				
				if (tokens[i].find("ERROR"sv) != strv::npos)
				{
					tokens.erase(tokens.begin() + i);
					ret = ERR;
					break;
				}
			}
			
			addURCs(tokens);
			
			return ret;
		}
		
		/**
		* @note Calls va_end().
		*/
		int32_t FormatArgs(char *buf, size_t buf_len, const char *fmt, std::va_list args)
		{
			if (!fmt)
				return FAIL;
			
			const int len = vsnprintf(buf, buf_len, fmt, args);
			va_end(args);
			
			if (len < 0)
				return FAIL;
			
			if (len >= buf_len)
				return BIG_PARAM;
			
			return len;
		}
		
		template <size_t ARG_LEN = DEFAULT_ARG_LEN, size_t LEN = DEFAULT_RESPONSE_LEN>
		ErrorCode NoToken(const uint32_t timeout, const CommandType type, const strv cmd, const func<ErrorCode (strv)>& handler,
			const std::variant<const char *, const strv> fmt_args = ""sv, ...)
		{
			_GET_ARGS(fmt_args);
			
			if (!handler)
				return INVALID_PARAM;
			
			char buffer[LEN];
			int32_t len = Command(timeout, type, cmd, args, buffer, sizeof(buffer));
			if (len < OK)
				return ErrorCode(len);
			
			return handler(strv(buffer, len));
		}
		
		template <size_t ARG_LEN = DEFAULT_ARG_LEN, size_t LEN = DEFAULT_RESPONSE_LEN>
		ErrorCode EnterOnline(const uint32_t timeout, const CommandType type, const strv cmd, const std::variant<const char *, const strv> fmt_args = ""sv, ...)
		{
			_GET_ARGS(fmt_args);
			
			ErrorCode code = SingleToken<LEN>(timeout, type, cmd, args, {{"CONNECT"sv, OK}, {"NO CARRIER"sv, FAIL}}, false);
			
			if (code != OK)
				ExitOnline();
			
			return code;
		}
		
		ErrorCode ExitOnline(const uint32_t timeout = DEFAULT_ONLINE_TO_CMD_TIMEOUT)
		{
			HAL_Delay(timeout);	// Set with S12 - todo: check the last tranmisson/reception (CONNECT) time
			return SingleToken(timeout, CommandType::Bare, strv(), CMD_MODE, {{"NO CARRIER"sv, OK}}, false);
		}
		
		template <size_t CHUNK_LEN = 600, size_t ARG_LEN = DEFAULT_ARG_LEN, size_t LEN = DEFAULT_RESPONSE_LEN>
		int32_t ReceiveOnline(const uint32_t timeout, const uint32_t dl_to, const CommandType type, const strv cmd,
			const func<ErrorCode (strv, size_t)>& chunk_handler, const std::variant<const char *, const strv> fmt_args = ""sv, ...)
		{
			_GET_ARGS(fmt_args);
			
			std::unique_ptr<char[]> buf[2] = {std::make_unique<char[]>(CHUNK_LEN), std::make_unique<char[]>(CHUNK_LEN)};
			if (!buf[0] || !buf[1])
				return FAIL;
			
			ErrorCode code = EnterOnline<DEFAULT_ARG_LEN, LEN>(timeout, type, cmd, args);
			
			if (code != OK)
				return code;
			
			const bool urcEnabled = m_urcEnabled;
			
			ScopeActionF exit([this, urcEnabled]()
			{
				HAL_UART_AbortReceive_IT(p_huart);
				ExitOnline();
				
				if (urcEnabled)
					EnableURC(true);	// Can't use stopURC() and startURC() because the EventCallback is bound and we're using HAL_UARTEx_ReceiveToIdle_IT().
			});
			
			if (urcEnabled)
				EnableURC(false);
			
			const uint32_t start = HAL_GetTick();
			uint32_t rem = dl_to;
			size_t len = 0;
			ClampedInt<uint8_t, 0, std::size(buf) - 1> index = 0;
			
			HAL_UART_StateTypeDef state = HAL_UART_STATE_READY;
			HAL_StatusTypeDef stat = HAL_UARTEx_ReceiveToIdle_IT(p_huart, reinterpret_cast<uint8_t *>(buf[index].get()), CHUNK_LEN);
			
			while (stat == HAL_OK && code == OK && state == HAL_UART_STATE_READY && rem)
			{
				do
				{
					#ifdef STM32T_IWDG_TIMEOUT
					HAL_IWDG_Refresh(&hiwdg);
					#endif	// STM32T_IWDG_TIMEOUT
					
					state = HAL_UART_GetState(p_huart);
					rem = Time::Remaining_Tick(start, dl_to);
				}
				while (state == HAL_UART_STATE_BUSY_RX && rem);
				
				strv chunk = {buf[index].get(), size_t(p_huart->RxXferSize - p_huart->RxXferCount)};
				if (chunk == "\r\nNO CARRIER\r\n"sv)
					return len;		// end
				
				if (state == HAL_UART_STATE_READY && rem)
					stat = HAL_UARTEx_ReceiveToIdle_IT(p_huart, reinterpret_cast<uint8_t *>(buf[++index].get()), CHUNK_LEN);
				
				if (chunk_handler)
					code = chunk_handler(chunk, len);
				
				len += chunk.size();
			}
			
			if ((state != HAL_UART_STATE_READY || stat != HAL_OK) && !len)
				return FAIL;
			
			if (code != OK && !len)
				return code;
			
			if (!rem && !len)
				return TIMEOUT;
			
			return len;
		}
		
		template <size_t LEN = DEFAULT_RESPONSE_LEN>
		ErrorCode Tokens2(const uint32_t timeout, const CommandType type, const strv cmd, const strv args, const func<ErrorCode (vec<strv>&)>& op,
			const bool allowSingleEnded = false)
		{
			if (!op)
				return INVALID_PARAM;
			
			char buffer[LEN];
			int32_t len = Command(timeout, type, cmd, args, buffer, sizeof(buffer));
			if (len < OK)
				return ErrorCode(len);
			
			vec<strv> tokens;
			strv(buffer, len).tokenize("\r\n"sv, tokens, !allowSingleEnded);
			
			return op(tokens);
		}
		
		template <size_t LEN = DEFAULT_RESPONSE_LEN>
		ErrorCode Tokens3(const uint32_t timeout, const CommandType type, const strv cmd, const strv args, const func<ErrorCode (vec<strv>&)>& op,
			const bool allowSingleEnded = false)
		{
			if (!op)
				return INVALID_PARAM;
			
			char buffer[LEN];
			int32_t len = Command(timeout, type, cmd, args, buffer, sizeof(buffer));
			if (len < OK)
				return ErrorCode(len);
			
			vec<strv> tokens;
			strv(buffer, len).tokenize("\r\n"sv, tokens, !allowSingleEnded);
			
