SMMB-DEV/STM32-Tools/GSM/GSM.hpp
			if (tokens.size() == 0 || tokens.back() != "OK"sv)
				return Error(tokens);
			
			tokens.pop_back();
			
			return op(tokens);
		}
		
		template <size_t LEN = DEFAULT_RESPONSE_LEN>
		ErrorCode SingleToken(const uint32_t timeout, const CommandType type, const strv cmd, const strv args,
			const span<const std::pair<strv, ErrorCode>> responses, const bool allowSingleEnded)
		{
			return Tokens2<LEN>(timeout, type, cmd, args, [&](vec<strv>& tokens)
			{
				if (tokens.size() == 1)
				{
					for (auto resp : responses)
					{
						if (tokens[0] == resp.first)
							return resp.second;
					}
				}
				
				return Error(tokens);
			}, allowSingleEnded);
		}
		
		template <size_t ARG_LEN = DEFAULT_ARG_LEN, size_t LEN = DEFAULT_RESPONSE_LEN>
		ErrorCode SingleToken(const uint32_t timeout, const CommandType type, const strv cmd, const span<const std::pair<strv, ErrorCode>> responses,
			const bool allowSingleEnded, const char* const fmt, ...)
		{
			_FORMAT_ARGS();
			return SingleToken<LEN>(timeout, type, cmd, strv(args, argsLen), responses, allowSingleEnded);
		}
		
		template <size_t ARG_LEN = DEFAULT_ARG_LEN, size_t LEN = DEFAULT_RESPONSE_LEN>
		ErrorCode ReceiveOK(const uint32_t timeout, const CommandType type, const strv cmd, const std::variant<const char*, const strv> fmt_args = ""sv, ...)
		{
			_GET_ARGS(fmt_args);
			return SingleToken<LEN>(timeout, type, cmd, args, {{"OK"sv, OK}}, false);
		}
		
		template <size_t ARG_LEN = DEFAULT_ARG_LEN>
		ErrorCode WaitForReady(const uint32_t timeout, const CommandType type, const strv cmd, const std::variant<const char *, const strv> fmt_args = ""sv, ...)
		{
			_GET_ARGS(fmt_args);
			return SingleToken(timeout, type, cmd, args, {{"> "sv, OK}}, true);
		}
		
		template <size_t ARG_LEN = DEFAULT_ARG_LEN, size_t LEN = DEFAULT_RESPONSE_LEN>
		ErrorCode ResponseToken(const uint32_t timeout, const CommandType type, const strv cmd,
			const func<ErrorCode (vec<strv>&)>& op, const size_t ok_pos = 1, size_t expectedTokens = 2, const std::variant<const char *, const strv> fmt_args = ""sv, ...)
		{
			if (!op)
				return INVALID_PARAM;
			
			_GET_ARGS(fmt_args);
			
			return Tokens2<LEN + RESPONSE_EXTRA>(timeout, type, cmd, args, [ok_pos, cmd, this, &expectedTokens, &op](vec<strv>& tokens) mutable -> ErrorCode
			{
				bool ok = tokens.size() >= expectedTokens;
				size_t offset = 0;
				
				if (ok && ok_pos < expectedTokens)
				{
					--expectedTokens;
					ok = false;
					for (; offset + ok_pos < tokens.size(); ++offset)
					{
						if (tokens[offset + ok_pos] == "OK"sv)
						{
							tokens.erase(tokens.begin() + offset + ok_pos);
							ok = true;
							break;
						}
					}
				}
				
				if (ok)
				{
					const auto first = tokens[offset];
					ok &= tokens[offset].remove_prefix(cmd) && (tokens[offset].remove_prefix(": "sv) || tokens[offset].remove_prefix(":"sv));
					if (!ok)
						tokens[offset] = first;
				}
				
				if (!ok)
					return Error(tokens);
				
				addURCs(tokens, offset);
				for (size_t i = offset + expectedTokens; i < tokens.size(); ++i)
					addURC(tokens[i]);
				
				tokens.erase(tokens.begin(), tokens.begin() + offset);
				tokens.erase(tokens.begin() + expectedTokens, tokens.end());
				
				return op(tokens);
			});
		}
		
		template <size_t ARG_LEN = DEFAULT_ARG_LEN, size_t LEN = DEFAULT_RESPONSE_LEN>
		ErrorCode DelayedResponseToken(const uint32_t timeout, const CommandType type, const strv cmd, const func<ErrorCode (strv)>& op,
			const std::variant<const char *, const strv> fmt_args = ""sv, ...)
		{
			_GET_ARGS(fmt_args);
			
			bool done = false;
			const uint32_t start = HAL_GetTick();
			
			ErrorCode code = Tokens2<LEN>(timeout, type, cmd, args, [&](vec<strv>& tokens)
			{
				if (tokens.size() < 1  || tokens.size() > 2 || tokens[0] != "OK"sv)
					return Error(tokens);
				
				if (tokens.size() == 2)		// In case the response wasn't actually delayed
				{
					done = true;
					
					const auto t = tokens[1];
					const bool ok = tokens[1].remove_prefix(cmd) && (tokens[1].remove_prefix(": "sv) || tokens[1].remove_prefix(":"sv));
					if (!ok)
					{
						addURC(t);
						return UNKNOWN;
					}
					
					return op(tokens[1]);
				}
				
				return OK;
			});
			
			if (code != OK || done)
				return code;
			
			return ResponseToken<ARG_LEN, LEN>(Time::Remaining_Tick(start, timeout), CommandType::Bare, cmd,
				[&](vec<strv>& tokens) { return op(tokens[0]); }, SIZE_MAX, 1);
		}
		
		template <size_t LEN = DEFAULT_RESPONSE_LEN>
		[[deprecated("Use StrToken2() instead. Will be removed before 1.0.0.")]]
		ErrorCode StrToken(char * const buf, size_t max_len, const CommandType type, const strv cmd, const strv args = strv())
		{
			return NoToken<DEFAULT_ARG_LEN, LEN>(DEFAUL_RECEIVE_TIMEOUT, type, cmd, [&](strv str)
			{
				const strv orig = str;
				
				if (!str.remove_suffix("\r\n\r\nOK\r\n"sv) || !str.remove_prefix("\r\n"sv))
				{
					addURCFromBuf(orig);
					return UNKNOWN;
				}
				
				const size_t len = std::min(str.length(), max_len - 1);
				memcpy(buf, str.data(), len);
				buf[len] = 0;
				
				return OK;
			}, args);
		}
		
		template <size_t LEN = DEFAULT_RESPONSE_LEN>
		int32_t StrToken2(char * const buf, size_t max_len, const CommandType type, const strv cmd, const strv args = strv())
		{
			return NoToken<DEFAULT_ARG_LEN, LEN>(DEFAUL_RECEIVE_TIMEOUT, type, cmd, [&](strv str) -> ErrorCode
			{
				const strv orig = str;
				
				if (!str.remove_suffix("\r\n\r\nOK\r\n"sv) || !str.remove_prefix("\r\n"sv))
				{
					addURCFromBuf(orig);
					return UNKNOWN;
				}
				
				const size_t len = std::min(str.length(), max_len - 1);
				memcpy(buf, str.data(), len);
				buf[len] = 0;
				
				return ErrorCode(len);
			}, args);
		}
		
		
		
		virtual ErrorCode Setup(const uint32_t timeout_ms = 1000)
		{
			static constexpr strv CMD = "E0;+CMEE=1;+CMGF=1;+CSCS=\"UCS2\";"
				"+CSMP=49,167,0,8;"sv;
				//"+CSAS;&W"sv;
			
			static_assert(CMD.size() + 9 < DEFAULT_RESPONSE_LEN);	// Echo might be enabled
			
