SMMB-DEV/STM32-Tools/GSM/GSM.hpp
			return ReceiveOK(timeout_ms, CommandType::Execute, CMD);
		}
		
	public:
		struct DateTime
		{
			uint16_t yyyy;
			uint8_t MM, dd, hh, mm, ss;
			int8_t zz;
			
			static std::optional<DateTime> Parse(strv view)
			{
				DateTime dt;
				
				size_t s1 = 0, s2 = 0;
				
				int n = sscanf(view.data(), "\"%4hu/%2hhu/%2hhu,%2hhu:%2hhu:%2hhu%zn%3hhd%zn", &dt.yyyy, &dt.MM, &dt.dd, &dt.hh, &dt.mm, &dt.ss, &dt.zz, &s1, &s2);
				if (n >= 6 && s1 > 0)
				{
					if (s1 == 17 && dt.yyyy < 100)
						dt.yyyy = (dt.yyyy < 70 ? 2000 : 1900) + dt.yyyy;
					else if (s1 != 19)
						return std::nullopt;
					
					view.remove_prefix(std::max(s1, s2));
					if (!view.starts_with('"'))
						return std::nullopt;
					
					if (dt.IsSet())
						return dt;
				}
				
				return std::nullopt;
			}
			
			static std::optional<DateTime> ParseNTP(strv view)
			{
				DateTime dt;
				
				if (int n; sscanf(view.data(), "%2hhu/%2hhu/%2hhu,%2hhu:%2hhu:%2hhu%n", &dt.yyyy, &dt.MM, &dt.dd, &dt.hh, &dt.mm, &dt.ss, &n) == 6 && n > 0)
				{
					dt.yyyy = (dt.yyyy < 70 ? 2000 : 1900) + dt.yyyy;
					
					view.remove_prefix(size_t(n));
					if (sscanf(view.data() + n, "%3hhd", &dt.zz) != 1)
					{
						if (view.empty())
							dt.zz = 0;
						else
							return std::nullopt;
					}
					
					if (dt.IsSet())
						return dt;
				}
				
				return std::nullopt;
			}
			
			static std::optional<DateTime> ParseSMS(strv view)
			{
				DateTime dt;
				
				size_t s = 0;
				
				if (7 == sscanf(view.data(), "\"%4hhu/%2hhu/%2hhu %2hhu:%2hhu:%2hhu%3hhd\"%zn", &dt.yyyy, &dt.MM, &dt.dd, &dt.hh, &dt.mm, &dt.ss, &dt.zz, &s) && s > 0)
				{
					if (s == 21 && dt.yyyy < 100)
						dt.yyyy = (dt.yyyy < 70 ? 2000 : 1900) + dt.yyyy;
					else if (s != 23)
						return std::nullopt;
					
					if (dt.IsSet())
						return dt;
				}
				
				return std::nullopt;
			}
			
			bool IsSet() const
			{
				return MM >= 1 && MM <= 12 && dd >= 1 && dd <= Time::MonthDays(MM - 1, yyyy) && hh <= 23 && mm <= 59 && ss <= 60 && zz >= -47 && zz <= 48;
			}
			
			const char* Format() const
			{
				static char fmt[32] = { 0 };
				
				const int16_t mins = zz * 15;
				const int8_t hour = mins / 60, min = mins % 60;
				
				sprintf(fmt, "%04hu-%02hhu-%02hhu %02hhu:%02hhu:%02hhu%+03hhd:%02hhu", yyyy, MM, dd, hh, mm, ss, hour, std::abs(min));
				return fmt;
			}
		};
		
		GSM(UART_HandleTypeDef* huart) : p_huart(huart) {}
		
		ErrorCode AT(const uint32_t timeout = DEFAUL_RECEIVE_TIMEOUT)
		{
			return ReceiveOK(timeout, CommandType::Execute, {}, "");
		}
		
		template <size_t LEN = DEFAULT_RESPONSE_LEN>
		ErrorCode Custom(strv command, const uint32_t timeout = DEFAUL_RECEIVE_TIMEOUT)
		{
			return ReceiveOK<DEFAULT_ARG_LEN, LEN>(timeout, CommandType::Execute, command);
		}
		
		
		// ********************************* V.25TER **********************************
		ErrorCode FactoryReset()
		{
			return ReceiveOK(DEFAUL_RECEIVE_TIMEOUT, CommandType::Execute, "&F"sv);
		}
		
		
		// ****************************** 3GPP TS 27.007 ******************************
		
		int32_t GetBrand(char *const buf, const size_t max_len)
		{
			return StrToken2(buf, max_len, CommandType::Execute, "+CGMI"sv);
		}
		
		int32_t GetModel(char *const buf, const size_t max_len)
		{
			return StrToken2(buf, max_len, CommandType::Execute, "+CGMM"sv);
		}
		
		/**
		* @param rev - Will be null-terminated.
		*/
		int32_t GetRevision(char *const rev, const size_t max_len)
		{
			return StrToken2(rev, max_len, CommandType::Execute, "+CGMR"sv);
		}
		
		/**
		* @param imei - Must have at least IMEI_LEN + 1 bytes. It will have exactly IMEI_LEN characters and will be null-terminated on success.
		*/
		ErrorCode GetIMEI(char *const imei)
		{
			static_assert(IMEI_LEN + 4 + 6 < DEFAULT_RESPONSE_LEN);
			
			int32_t len = StrToken2(imei, IMEI_LEN + 1, CommandType::Execute, "+CGSN"sv);
			if (len != IMEI_LEN)
				return WRONG_FORMAT;
			
			uint8_t sum = 0;
			for (size_t i = 0; i < IMEI_LEN; i += 2)
				sum += imei[i] - '0';
			
			for (size_t i = 1; i < IMEI_LEN; i += 2)
			{
				const uint8_t _double = (imei[i] - '0') * 2;
				sum += _double / 10 + _double % 10;
			}
			
			return (sum % 10 == 0) ? OK : WRONG_FORMAT;
		}
		
		ErrorCode GetIMEI(uint64_t &imei)
		{
			char imei_s[IMEI_LEN + 1];
			ErrorCode code = GetIMEI(imei_s);
			if (code != OK)
				return code;
			
			return strv(imei_s, IMEI_LEN).to_num(imei) == IMEI_LEN ? OK : WRONG_FORMAT;
		}
		
		/**
		* @param imsi - Must have at least IMSI_LEN + 1 bytes. It will have exactly IMSI_LEN characters and will be null-terminated on success.
		*/
		ErrorCode GetIMSI(char *const imsi)
		{
			static_assert(IMSI_LEN + 4 + 6 < DEFAULT_RESPONSE_LEN);
			
			const int32_t len = StrToken2(imsi, IMSI_LEN + 1, CommandType::Execute, "+CIMI"sv);
			return len == IMSI_LEN ? OK : WRONG_FORMAT;
		}
		
		ErrorCode GetIMSI(uint16_t &mcc, uint8_t &mnc)
		{
			char imsi[IMSI_LEN + 1];
			
			const ErrorCode code = GetIMSI(imsi);
			if (code != OK)
				return code;
			
			strv imsi_sv(imsi, IMSI_LEN);
			if (imsi_sv.to_num(mcc, 0, 3) != 3 || imsi_sv.to_num(mnc, 3, 2) != 2)
				return WRONG_FORMAT;
			
			return OK;
		}
		
		/**
		* @param rssi - Signal strength in dbm. Not available if positive or zero.
		* @param ber - Bit error rate (average) per ten thousand. Not available if negative.
		*/
		ErrorCode GetSignalQuality(int8_t& rssi, int16_t& ber)
		{
			return ResponseToken(DEFAUL_RECEIVE_TIMEOUT, CommandType::Execute, "+CSQ"sv, [&rssi, &ber](const std::vector<strv>& tokens) -> ErrorCode
			{
				uint8_t t1, t2;
				if (2 != sscanf(tokens[0].data(), "%2hhu,%2hhu", &t1, &t2) || (t1 > 31 && t1 != 99) || (t2 > 7 && t2 != 99))
					return WRONG_FORMAT;
				
				if (t1 <= 31)
					rssi = -113 + t1 * 2;
				else
					rssi = 0;
				
				if (t2 <= 7)
				{
					static constexpr int16_t AVG[8] = {14, 28, 57, 113, 226, 453, 905, 1810};
					
					ber = AVG[t2];
				}
				else
					ber = -1;
				
				return OK;
			});
		}
		
		
		// ****************************** 3GPP TS 27.005 ******************************
		
		ErrorCode SMSend(u16strv number, const STM32T::span<const u16strv> msgs, const uint32_t timeout = 60'000)
		{
			using STM32T::Log::IsEnabled;
			using STM32T::Log::LOG_D;
			using STM32T::Log::LOG_W;
			
			if constexpr (IsEnabled<LG>(Log::Level::Debug))
			{
				const auto end_opt = number.size() >= 4 ? U16ToU8(number.substr(number.size() - 4)) : std::string();
				std::string hidden(std::min(number.size(), number.size() - 4), 'x');
				
