SMMB-DEV/STM32-Tools/GSM/GSM.hpp
				if (end_opt && !hidden.empty())
					LOG_D<LG>("Sending SM to %s%s...", hidden.data(), end_opt->data());
				else
					LOG_D<LG>("Sending SM...");
			}
			
			SendUART("AT+CMGS=\""sv);
			SendUCS2(number);
			ErrorCode code = WaitForReady(1000, CommandType::Bare, ""sv, "\"\r"sv);
			
			uint8_t n;
			
			if (code != OK)
			{
				SendUART(ESC);
				goto ret;
			}
			
			for (auto msg : msgs)
				SendUCS2(msg);
			
			// \r\n+CMGS: 255\r\n\r\nOK\r\n
			code = ResponseToken(timeout, CommandType::Bare, "+CMGS"sv,
				[&n](const std::vector<strv>& tokens) -> ErrorCode { return sscanf(tokens[0].data(), "%3hhu", &n) == 1 ? OK : WRONG_FORMAT; }, 1, 2, CTRL_Z);
			
		ret:
			if (code == OK)
				LOG_D<LG>("SM sent successfully (%hhu).", n);
			else
				LOG_W<LG>("SM could not be sent (%d)!", code);
			
			return code;
		}
		
		
		#ifdef STM32T_GSM_URC_ENABLED
	private:
		class URC
		{
			friend class GSM<DEF_RX_TO, DEF_IDLE_TO>;
			friend class LinkedList<URC, 32>;
			
			char *m_buf;
			size_t m_size;
			uint32_t m_timestamp;
			
			URC(const URC& other) = delete;
			URC(URC&& other) : m_buf(other.m_buf), m_size(other.m_size), m_timestamp(other.m_timestamp)
			{
				other.m_buf = nullptr;
				other.m_size = 0;
			}
			
			~URC()
			{
				delete[] m_buf;
				m_buf = nullptr;
				m_size = 0;
			}
			
			URC(const strv& urc) : URC(urc, HAL_GetTick()) {}
			URC(const strv& urc, const uint32_t timestamp) : m_buf(new char[urc.size() + 1]), m_size(urc.size()), m_timestamp(timestamp)
			{
				memcpy(m_buf, urc.data(), m_size);
				m_buf[m_size] = 0;
			}
			
			operator strv() const { return {m_buf, m_size}; }
		};
		
		uint8_t m_buf[(STM32T_GSM_URC_BUF_SIZE)];
		LinkedList<URC, 32> m_urcs;
		
		static inline This *s_this = nullptr;
		
		void startURC()
		{
			__HAL_UART_CLEAR_OREFLAG(p_huart);
			
			HAL_UARTEx_ReceiveToIdle_DMA(p_huart, m_buf, sizeof(m_buf));
			__HAL_DMA_DISABLE_IT(p_huart->hdmarx, DMA_IT_HT);	//Disable half transfer interrupt if it is enabled in HAL_UARTEx_ReceiveToIdle_DMA()
		}
		
		void stopURC() { HAL_UART_DMAStop(p_huart); }	// todo: handle half received URC
		
	protected:
		void addURC(const strv token)
		{
			m_urcs.push_back(URC{token});
		}
		
	public:
		void EnableURC(bool enable = true)
		{
			if (enable)
			{
				if (m_urcEnabled)
					return;
				
				s_this = this;
				
				HAL_UART_RegisterRxEventCallback(p_huart, [](UART_HandleTypeDef *huart, uint16_t size)
				{
					if (!s_this)	// todo: find a better way
						return;
					
					const Time::cycle_t start = Time::GetCycle();
					
					strv data = {reinterpret_cast<const char *>(huart->pRxBuffPtr), size};
					data.tokenize("\r\n"sv, [](const strv token) { s_this->addURC(token); }, false);
					
					const Time::cycle_t end = Time::GetCycle();
					const auto time = Time::CyclesTo_us(end - start);
					
					static const Time::us_time_t MaxTime = 1'000'000u * 10u / huart->Init.BaudRate;		// Time of 1 byte
					
					if (time >= MaxTime)	// todo: Can't use LG directly (LOG_W<LG>)
						LG.w("Rx event proccessing time (%u us) has exceeded maximum (%u us).", time, MaxTime);
					
					s_this->startURC();
					
				});
				
				startURC();
				m_urcEnabled = true;
			}
			else
			{
				if (!m_urcEnabled)
					return;
				
				m_urcEnabled = false;
				s_this = nullptr;
				// todo: clear m_urcs?
				
				stopURC();
				HAL_UART_UnRegisterRxEventCallback(p_huart);
			}
		}
		
		/**
		* @param handler - If it returns true, the urc will be removed and considered handled.
		* @retval - The number of urcs handled.
		*/
		size_t HandleURCs(const func<bool (strv, uint32_t ts)>& handler, const bool stop_when_handled = false)
		{
			if (!handler)
				return 0;
			
			size_t handled = 0;
			auto it = m_urcs.begin();
			while (it != m_urcs.end())
			{
				if (handler(*it, it->m_timestamp))
				{
					it = m_urcs.erase(it);
					++handled;
					
					if (stop_when_handled)
						return handled;
				}
				else
					++it;
			}
			
			return handled;
		}
		
		/**
		* @retval - The number of urcs handled.
		*/
		size_t HandleURCs(const func<void (strv, uint32_t ts)>& handler)
		{
			return HandleURCs(std::function<bool (strv, uint32_t)>([&handler](strv token, uint32_t ts) -> bool
			{
				handler(token, ts);
				return true;
			}));
		}
		#else
	protected:
		void addURC(const strv token) {}
		void startURC() {}
		void stopURC() {}
		
	public:
		void EnableURC(bool enable = true) {}
		#endif	// STM32T_GSM_URC_ENABLED
	};
}
#endif	// HAL_UART_MODULE_ENABLED
